---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FluidFailures.UndefinedFluidType
source: html/028e0af6-93b4-37de-2b1d-1202dc6d9c65.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FluidFailures.UndefinedFluidType Property

The fluid type '[Type Name]' is not defined

## Syntax (C#)
```csharp
public static FailureDefinitionId UndefinedFluidType { get; }
```